{"Id":"71a7986b-1eb1-4f7a-948b-ff8246889f7d","Name":"Challenge Mode","Version":"1.0.0","Author":"Echocolat","Contributors":[],"Description":"## TOTK Challenge Mode\r\n\r\n### Mod description\r\n\r\nThis mod aims to make Tears of the Kingdom __harder__ by adding new, __more dangerous enemies__ and __tweaking game mechanics__ for a more challenging and interesting experience with the game. It is __recommended to start a whole new save__ with this mod for the best experience possible!\r\n\r\n#### Features\r\n- All scalable enemies (Bokoblins, Moblins, Lizalfos, Horriblins, Boss Bokoblins, Lynels, Soldier Constructs and Captain Constructs) __were scaled by one rank__. For example, all red Bokoblins are blue in the mod. At least one specimen of each base enemy will stay, for Hyrule Compendium, Quests or Armor upgrades.\r\n- All scalable enemies now have a new rank (Golden for all Monsters, Seized for the Constructs), __stronger__, tankier, faster, but also __more rewarding__ with their unique fusable materials and better overall drops. \r\n- All mini bosses (Molduga, Gleeok, Frox, Flux Construct, Hinox and Talus) now have a new, __unique__ more powerful rank, wielding unique fuse materials. You can learn more about them in the __Challenge Mode - Rumors__ book in the Room of Awakening.\r\n- New weapons were added, or readded! __Lynel weapons__ are back. You can also get the standalone version of Lynel weapons [here](https://gamebanana.com/mods/494687), thanks to Godzilaa4 for making the mod! Zonaite weapons also got a __new rank__ of weapons in order to make them more interesting in mid and late game.\r\n- A wide array of map changes were made to the surface, mostly to add more __Lynels__ to the map and make the enemy camps more diversified. __No more Bokoblin only camps__!\r\n- As a development to the previous change, the six __Monster Camps__ involved in the Monster Control Crew quests have been severely buffed, making a hard late game challenge. They were given __new, powerful and unique reward__ for three of them, so don\u0027t forget to check them out!\r\n\r\n#### Options\r\n\r\nThis mod comes with multiple options that when all activated represent what we envisioned when creating it, but that we are aware won\u0027t please everybody, that is why they are options.\r\n\r\n##### Additions\r\n- **All bosses buff**: Bosses are all stronger and faster, Dungeon bosses deal gloom damage. (__recommended__)\r\n- ~~**All enemies scale**: Very unrecommended option unless you want to suffer. This makes it so that all map enemies scale automatically if possible, regardless of their map parameters. Basically, all camps will be full golden in NG\u002B, and will become full golden at some point after playing in non NG\u002B.~~ Currently TKMM fucks up the whole mod when this option is enabled. The .tkcl file will be updated once TKMM is fixed in that regard.\r\n- **Brazilian over American English**: Playing with the American English language will instead use the brazilian translation made by the [Triforce Heroes Team](https://triforce-heroes.com.br/) (for the vanilla game) and Godzilaa4 (for the Challenge Mode part).\r\n- **Challenge Mode enemies are faster**: All enemies introduced in Challenge Mode are faster than their previous counterparts. (__recommended__)\r\n- **Dangerous Bokoblin Baskets**: Elemental fruits thrown by Bokoblins from their baskets have the area of effect of associated elemental gems.\r\n- ~~**Enemy Health Regeneration**: Most of the enemies regenerate slowly their health on a %age basis, until they regenerated 100% of their health. The regeneration rate is smaller when the enemy has more HP. Made by MaxLastBreath.~~ Will be added later, as the team member handling this option currently faces personal life issues.\r\n- **True Demon King\u0027s Army**: Custom Demon King\u0027s Army made more interesting and way harder. (__recommended__)\r\n\r\n##### Buffs\r\n- **Better Defense Up meal effect**: The Defense Up meal effect is buffed in order to make it viable and interesting against Attack Up. Level 1 goes from 4 to 12, Level 2 goes from 12 to 24 and Level 3 goes from 24 to 48. (__recommended__)\r\n\r\n##### Nerfs\r\n- **Higher Gloom damage multiplier**: Gloomed enemies in the vanilla game inflict 0.3x times their damage converted to gloomed hearts. This was changed to 0.8x their damage. (__recommended__)\r\n- **Hitstun nerf for Link**: Most of Link\u0027s attacks do not interrupt enemies\u0027 actions. (__recommended__)\r\n- **Nerfed charge attacks**: Link\u0027s charged attacks take more time to charge and take more stamina. Two handed weapon charge attack does less damage. (__recommended__)\r\n- **Nerfed Flurry Rush**: Link\u0027s Flurry Rushes inflict less hits. (__recommended__)\r\n- **No natural Gloomed hearts regeneration**: Gloomed hearts no longer regenerate on the Surface or under lightroots. This is heavily recommended because some new enemies will have your heart UI glitched without this option. (__recommended__)\r\n- **No One Shot Protection**: Disables one shot protection. (__recommended__)\r\n- **Oblivious sages**: Sages don\u0027t attack enemies, enemies aren\u0027t distracted by Sages. (__recommended__)\r\n\r\n##### Rebalances\r\n- **Rebalanced Armor upgrade cost**: Armor upgrades that need scalable enemy parts will require the level above, to take into account the Challenge Mode scaling. (__recommended__)\r\n- ~~**Rebalanced Chests**: Shrine and Dungeon chests content was changed to make them more interesting.~~ Currently TKMM fucks up the whole mod when this option is enabled. The .tkcl file will be updated once TKMM is fixed in that regard.\r\n- **Rebalanced Cooking**: It\u0027s impossible for the player to eat raw materials, and cooked food (e.g. Boiled Egg, Frozen and Roasted food) is no longer able to stack. Non Zonai scalable enemy parts were buffed, or heavily buffed compared to vanilla, so that they still offer some value even compared to the new, very powerful golden enemy parts. (__recommended__)\r\n- ~~**Rebalanced modifiers**: Each weapon, bow and shield has now its unique ranges of modifier values. (__recommended__)~~ Currently TKMM fucks up the whole mod when this option is enabled. The .tkcl file will be updated once TKMM is fixed in that regard.\r\n- **Rebalanced mounted Lynel damage**: To take into account the DPS of weapons, one handed weapons deal less damage on the back of Lynels and two handed weapons deal even less damage.\r\n","ThumbnailUri":".thumbnail","OptionGroupReferences":["437285fe-3749-4b4b-af23-b786bdb7d1a4","b9741673-1591-46e2-a8ef-72a80711e500","2bc6a140-86ea-473c-b9a4-e781e72abbcb","b3191918-983e-4a90-ac40-cb7547f9657d"]}